print ( '----- Set 1-4 - excercise_4 -----' )
# 4. Γράψτε ένα πρόγραμμα το οποίο με δεδομένο ένα φυσικό αριθμό n υπολογίζει και τυπώνει
# το άθροισμα 1 + 2 + ... + n.
# Κάντε το ίδιο για το άθροισμα των τετραγώνων των πρώτων n φυσικών αριθμών.
# Ελέγξτε τα αποτελέσματά σας χρησιμοποιώντας γνωστούς τύπους για τα συγκεκριμένα αθροίσματα.
n = int ( input ( 'Give a number: ') )
s = 0
s_sqr = 0
for i in range (0, n):
    s = s + i + 1
    s_sqr = s_sqr + ((i + 1) ** 2)
print ( '\nSimple sum =', s )
print ( 'Squares sum =', s_sqr )
